#include <sys/mman.h>
#include <unistd.h>
#include <stdio.h>
#include <stdint.h>
#include <stddef.h>
#include <dlfcn.h>
#include <stdlib.h>
#include <pthread.h>
#include <setjmp.h>
#include <string.h>
#include <wchar.h>
#include <malloc.h>
#include <time.h>
#include <android/log.h>
#include <mutex>

#define LOGI(...) __android_log_print(ANDROID_LOG_INFO, "FET:Native", __VA_ARGS__)
#define LOGE(...) __android_log_print(ANDROID_LOG_ERROR, "FET:Native", __VA_ARGS__)

// Rename shims to avoid symbol clashes with host libraries (like libcoreclr.so)
#define VirtualAlloc HleVirtualAlloc
#define VirtualFree HleVirtualFree
#define GetCurrentProcessId HleGetCurrentProcessId
#define CreateFileW HleCreateFileW
#define ReadFile HleReadFile
#define WriteFile HleWriteFile
#define CloseHandle HleCloseHandle
#define GetStdHandle HleGetStdHandle
#define GetCommandLineW HleGetCommandLineW
#define GetCommandLineA HleGetCommandLineA
#define MessageBoxW HleMessageBoxW
#define ExitProcess HleExitProcess
#define GetLastError HleGetLastError
#define SetLastError HleSetLastError
#define LocalAlloc HleLocalAlloc
#define LocalFree HleLocalFree
#define GetModuleHandleW HleGetModuleHandleW
#define GetModuleHandleA HleGetModuleHandleA
#define GetFileSizeEx HleGetFileSizeEx
#define SetFilePointerEx HleSetFilePointerEx
#define SetConsoleMode HleSetConsoleMode
#define GetNumberOfConsoleInputEvents HleGetNumberOfConsoleInputEvents
#define ReadConsoleInputW HleReadConsoleInputW

#define RaiseException HleRaiseException
#define RtlRaiseException HleRtlRaiseException
#define RtlLookupFunctionEntry HleRtlLookupFunctionEntry
#define RtlPcToFileHeader HleRtlPcToFileHeader
#define RtlUnwindEx HleRtlUnwindEx
#define RtlUnwind HleRtlUnwind
#define QueryPerformanceCounter HleQueryPerformanceCounter
#define GetSystemTimeAsFileTime HleGetSystemTimeAsFileTime
#define GetCurrentThreadId HleGetCurrentThreadId
#define GetEnvironmentStringsW HleGetEnvironmentStringsW
#define FreeEnvironmentStringsW HleFreeEnvironmentStringsW
#define GetStartupInfoW HleGetStartupInfoW
#define SetStdHandle HleSetStdHandle
#define TerminateProcess HleTerminateProcess
#define FreeLibrary HleFreeLibrary
#define GetModuleHandleExW HleGetModuleHandleExW
#define GetFileType HleGetFileType
#define GetConsoleCP HleGetConsoleCP
#define GetConsoleOutputCP HleGetConsoleOutputCP
#define GetConsoleMode HleGetConsoleMode
#define FlushFileBuffers HleFlushFileBuffers
#define WideCharToMultiByte HleWideCharToMultiByte
#define MultiByteToWideChar HleMultiByteToWideChar
#define WriteConsoleW HleWriteConsoleW
#define GetCurrentProcess HleGetCurrentProcess
#define SetUnhandledExceptionFilter HleSetUnhandledExceptionFilter
#define OutputDebugStringW HleOutputDebugStringW
#define IsDebuggerPresent HleIsDebuggerPresent
#define GetProcAddress HleGetProcAddress
#define GetModuleFileNameW HleGetModuleFileNameW
#define GetModuleFileNameA HleGetModuleFileNameA
#define SetEnvironmentVariableW HleSetEnvironmentVariableW
#define SetConsoleCtrlHandler HleSetConsoleCtrlHandler
#define FindClose HleFindClose
#define CompareStringW HleCompareStringW
#define LCMapStringW HleLCMapStringW
#define GetLocaleInfoW HleGetLocaleInfoW
#define IsValidLocale HleIsValidLocale
#define GetUserDefaultLCID HleGetUserDefaultLCID
#define EnumSystemLocalesW HleEnumSystemLocalesW
#define GetCurrentThread HleGetCurrentThread
#define GetCPInfo HleGetCPInfo
#define GetOEMCP HleGetOEMCP
#define GetACP HleGetACP
#define IsValidCodePage HleIsValidCodePage
#define FormatMessageA HleFormatMessageA
#define FindFirstFileA HleFindFirstFileA
#define FindNextFileA HleFindNextFileA
#define FindFirstFileExW HleFindFirstFileExW
#define FindNextFileW HleFindNextFileW
#define GetFullPathNameA HleGetFullPathNameA
#define SetFilePointer HleSetFilePointer
#define GetFileVersionInfoSizeW HleGetFileVersionInfoSizeW
#define GetFileVersionInfoSizeA HleGetFileVersionInfoSizeA
#define GetFileVersionInfoW HleGetFileVersionInfoW
#define GetFileVersionInfoA HleGetFileVersionInfoA
#define VerQueryValueW HleVerQueryValueW
#define VerQueryValueA HleVerQueryValueA
#define GetVersionExA HleGetVersionExA
#define LoadLibraryExW HleLoadLibraryExW
#define LoadLibraryExA HleLoadLibraryExA
#define GetCurrentDirectoryA HleGetCurrentDirectoryA
#define CreateFileA HleCreateFileA
#define GetDateFormatW HleGetDateFormatW
#define GetTimeFormatW HleGetTimeFormatW

typedef void* HANDLE;
typedef uint32_t DWORD;
typedef uint32_t UINT;

// Win32 Thread Environment Block (TEB) fake structure
struct FakeTeb {
    void* ExceptionList;             // 0x00
    void* StackBase;                 // 0x08
    void* StackLimit;                // 0x10
    void* SubSystemTib;              // 0x18
    void* FiberData;                 // 0x20
    void* ArbitraryUserPointer;      // 0x28
    FakeTeb* Self;                   // 0x30
    void* EnvironmentPointer;        // 0x38
    uint64_t UniqueProcess;          // 0x40
    uint64_t UniqueThread;           // 0x48
    void* ActiveRpcHandle;           // 0x50
    void* ThreadLocalStoragePointer; // 0x58
    
    uint8_t Padding[0x1480 - 0x60];
    void* TlsSlots[64];              // 0x1480
    
    // Static TLS simulation
    void* StaticTlsArray[64];
    void* StaticTlsBlocks[64];
};

jmp_buf g_ExitBuf;
int g_ExitCode = 0;

static wchar_t* g_CommandLineW = nullptr;
static char* g_CommandLineA = nullptr;

class ScopedBionicContext {
private:
    uintptr_t saved_teb;
    bool swapped;
public:
    ScopedBionicContext() : saved_teb(0), swapped(false) {
        uintptr_t current_x18;
        asm volatile("mov %0, x18" : "=r"(current_x18));
        if (current_x18 > 0x1000) {
            FakeTeb* teb = (FakeTeb*)current_x18;
            if (teb->Self == teb) {
                saved_teb = current_x18;
                uintptr_t scs = (uintptr_t)teb->ArbitraryUserPointer;
                asm volatile("mov x18, %0" : : "r"(scs));
                swapped = true;
            }
        }
    }
    ~ScopedBionicContext() {
        if (swapped) {
            asm volatile("mov x18, %0" : : "r"(saved_teb));
        }
    }
};

